driver-tests/databasebc/MySQL/Insert_Mysql_Jbi_New/test/TestInsert/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tab="http://j2ee.netbeans.org/xsd/tableSchema">
  <soapenv:Body>
    <tab:TestTable>
      <!--1 or more repetitions:-->
      <tab:TestTable_Record>
        <tab:TestSal>1000</tab:TestSal>
        <tab:TestID>100</tab:TestID>
        <tab:TestFlag>10</tab:TestFlag>
        <tab:TestName>FirstTest</tab:TestName>
      </tab:TestTable_Record>
    </tab:TestTable>
  </soapenv:Body>
</soapenv:Envelope>