driver-tests/databasebc/Oracle10g/Find_Ora10g_JBI/test/TestFindOra/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:TestTable xmlns:msgns="http://j2ee.netbeans.org/wsdl/SOAPFindOraTrigger" xmlns:ns1="http://j2ee.netbeans.org/xsd/tableSchema">
      <TestTable_Record xmlns="http://j2ee.netbeans.org/xsd/tableSchema">
        <TESTSAL>1000</TESTSAL>
        <TESTID>2</TESTID>
        <TESTFLAG>0</TESTFLAG>
        <TESTNAME>InsertOra</TESTNAME>
      </TestTable_Record>
    </ns1:TestTable>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
